Конфигурация/InformationRegisters/ВременноеХранилищеОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВременноеХранилищеОтчетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкземплярыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НаличиеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НаличиеФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕстьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСФайловымХранилищем/Ext/Module.bsl
Процедура ДобавитьКомандуПрисоединенныеФайлы(Форма, ОсновнойРеквизит) Экспорт

	ВладелецПрисоединенныхФайлов = Метаданные.ОпределяемыеТипы.ВладелецПрисоединенныхФайлов;
	Если ВладелецПрисоединенныхФайлов.Тип.СодержитТип(ТипЗнч(ОсновнойРеквизит)) Тогда
		
		ОбщаяКоманда = Форма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаОбщаяКомандаПрисоединенныеФайлы");
		Если ОбщаяКоманда <> Неопределено Тогда
			ОбщаяКоманда.Видимость = Ложь;
		КонецЕсли; 
		
		ИмяКоманды = "ОткрытьПрисоединенныеФайлы";
		
		Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
			КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
			КомандаФормы.Действие = "Подключаемый_ОткрытьПрисоединенныеФайлы";
			КомандаФормы.Картинка = БиблиотекаКартинок.Скрепка;
			КомандаФормы.Заголовок = "Присоединенные файлы";
			КомандаФормы.Подсказка = "Присоединенные файлы";
			КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
			КомандаФормы.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Форма.КоманднаяПанель);
		НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;

	КонецЕсли;
	
КонецПроцедуры

Функция КраткоеПредставлениеРазмера(Знач Размер) Экспорт
	
	Если Размер = 0 Тогда
		Возврат "-";
	ИначеЕсли Размер < 1024 * 10 Тогда // < 10 Кб
		Возврат СтрШаблон("%1 Кб", Формат(Макс(1, Окр(Размер / 1024, 1, 1)), "ЧГ=0"));
	ИначеЕсли Размер < 1024 * 1024 Тогда // < 1 Мб
		Возврат СтрШаблон("%1 Кб", Формат(Цел(Размер / 1024), "ЧГ=0"));
	ИначеЕсли Размер < 1024 * 1024 * 10 Тогда // < 10 Мб
		Возврат СтрШаблон("%1 Мб", Формат(Окр(Размер / 1024 / 1024, 1, 1), "ЧГ=0"));
	Иначе // >= 10 Мб
		Возврат СтрШаблон("%1 Мб", Формат(Цел(Размер / 1024 / 1024), "ЧГ=0"));
	КонецЕсли;
	
КонецФункции

#Область Работа_с_файловым_хранилищем_через_веб_сервис

#Область Интерфейс

// Используется для получения настроек подключения к файловому хранилищу
//
// Возвращаемое значение:
//	Структура, содержащая параметры подключения
//		свойства структуры:
//			АдресВебСервиса								- строка с URL веб-сервиса файлового хранилища
//			АутентификацияОС							- булево, флаг определяющий тип подключения через аутентификацию ОС или через указание пользователя и пароля
//			ИмяПользователя								- строка с именем пользователя
//			ПарольПользователя							- строка с паролем пользователя
//			ИдентификаторОбщейПапкиФайлов				- строка с уникальным идентификатором общей папки файлов в файловом хранилище
//			АдресВебСервисаТестовогоФайловогоХранилища	- строка с URL веб-сервиса тестового файлового хранилища
//
//	В случае, если настройки не заданы, или данные в константе, в которой хранятся настройки не соответствуют ожидаемым, возвращаемое значение = Неопределено
//
Функция ПолучитьНастройкиПодключенияКФайловомуХранилищу() Экспорт
	
	Попытка
		Настройки = XMLЗначение(Тип("ХранилищеЗначения"), Константы.НастройкиПодключенияКФайловомуХранилищу.Получить()).Получить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Настройки;
	
КонецФункции

// Создает новый файл в файловом хранилище, записывая в него переданные двоичные данные
//
//	Параметры:
//	ДанныеФайла	- структура с описанием файла
//		свойства структуры:
//			Адрес					- адрес временного хранилища, по которому находятся двоичные данные файла
//			Имя						- имя файла (без расширения)
//			Расширение				- расширение файла (без точки)
//			НаименованиеВладельца	- строковое представление владельца файла (в результате будет создана папка с таким наименованием, куда будет помещен файл)
//			ИдентификаторВладельца	- строка с идентификатором владельца (идентификатор добавляется к имени папки)
//			ТипВладельца			- строковое представление типа владельца (в результате будет создана папка с таким наименованием, куда будет помещена папка с именем владельца)
//	Организация	- Организация для которой создается файл (по организации определяется папка хранения). Если организация не указана, будет использована общая папка.
//	              Если организация указана, но идентификатор папки для нее не задан, будет вызвано исключение.
//	ОтложеннаяВыгрузка - признак того что это работа с отчетностью. Отчетность сначала сохраняется в буферный регистр ВременноеХранилищеОтчетов.
//
// Возвращаемое значение:
//  Структура - содержащая идентификаторы файла и версии
//		свойства структуры:
//			ИдентификаторФайла	- строка с идентификатором файла в файловом хранилище для последующего получения файла
//			ИдентификаторВерсии	- строка с идентификатором первой версии файла
//
Функция СоздатьФайл(ДанныеФайла, Организация = Неопределено, ОтложеннаяВыгрузка = Ложь) Экспорт
	
	Если ОтложеннаяВыгрузка Тогда
		
		Попытка
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);
		Исключение
			ВызватьИсключение "При получении данных файла из временного хранилища произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		Попытка
			НоваяЗапись = РегистрыСведений.ВременноеХранилищеОтчетов.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.ЭкземплярОтчета = ДанныеФайла.Экземпляр;
			НоваяЗапись.ИдентификаторВерсии = Строка(Новый УникальныйИдентификатор);
			НоваяЗапись.ДвоичныеДанные = Новый ХранилищеЗначения(ДвоичныеДанныеФайла);
			НоваяЗапись.Имя = ДанныеФайла.Имя;
			НоваяЗапись.Расширение = ДанныеФайла.Расширение;
			НоваяЗапись.Записать();		
		Исключение
			ВызватьИсключение "При выполнении запроса создания файла произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		
		Результат = Новый Структура;
		
		Результат.Вставить("ИдентификаторФайла",	"");
		Результат.Вставить("ИдентификаторВерсии",	НоваяЗапись.ИдентификаторВерсии);
		
	Иначе	
		
		НастройкиПодключения = ПолучитьНастройкиПодключенияКФайловомуХранилищу();
		
		Если НастройкиПодключения = Неопределено Тогда
			ВызватьИсключение "Не указаны настройки подключения к файловому хранилищу!";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) Тогда
			
			Если НЕ ЗначениеЗаполнено(Организация.ИдентификаторПапкиВФайловомХранилище) Тогда
				ВызватьИсключение СтрШаблон("Для организации %1 не указан идентификатор папки файлов в файловом хранилище!", Организация);
			Иначе
				ИдентификаторПапкиФайлов = Организация.ИдентификаторПапкиВФайловомХранилище;
			КонецЕсли;
			
		Иначе
			
			Если НЕ НастройкиПодключения.Свойство("ИдентификаторОбщейПапкиФайлов")
				ИЛИ НЕ ЗначениеЗаполнено(НастройкиПодключения.ИдентификаторОбщейПапкиФайлов) Тогда
				ВызватьИсключение "Не указан идентификатор общей папки файлов в файловом хранилище!";
			Иначе
				ИдентификаторПапкиФайлов = НастройкиПодключения.ИдентификаторОбщейПапкиФайлов;
			КонецЕсли;
			
		КонецЕсли;
		
		ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища(НастройкиПодключения);
		
		Попытка
			Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMAddLinkedFileRequest");
		Исключение
			ВызватьИсключение "При создании запроса для добавления файла произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		Запрос.rootFolderID = ИдентификаторПапкиФайлов;
		
		Попытка
			Запрос.file = СоздатьОбъект(ПроксиВебСервиса, "DMFile");
		Исключение
			ВызватьИсключение "При создании объекта файла произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		Попытка
			Запрос.file.externalObject = СоздатьОбъект(ПроксиВебСервиса, "ExternalObject");
		Исключение
			ВызватьИсключение "При создании внешнего объекта для привязки файла произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		Запрос.file.externalObject.name	= ДанныеФайла.НаименованиеВладельца;
		Запрос.file.externalObject.ID	= ДанныеФайла.ИдентификаторВладельца;
		Запрос.file.externalObject.type	= ДанныеФайла.ТипВладельца;
		
		Попытка
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);
		Исключение
			ВызватьИсключение "При получении данных файла из временного хранилища произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		Запрос.file.objectID					= СоздатьObjectID(ПроксиВебСервиса, "", "DMFile");
		Запрос.file.binaryData					= ДвоичныеДанныеФайла;
		Запрос.file.name						= ДанныеФайла.Имя;
		Запрос.file.extension					= ДанныеФайла.Расширение;
		Запрос.file.size						= ДвоичныеДанныеФайла.Размер();
		
		ДатаСеанса = ТекущаяДатаСеанса();
		
		Запрос.file.modificationDate			= ДатаСеанса;
		Запрос.file.modificationDateUniversal	= УниверсальноеВремя(ДатаСеанса);
		
		Попытка
			Ответ = ПроксиВебСервиса.execute(Запрос);
		Исключение
			ВызватьИсключение "При выполнении запроса создания файла произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
		
		Результат = Новый Структура;
		
		Результат.Вставить("ИдентификаторФайла",	Ответ.file.objectID.ID);
		Результат.Вставить("ИдентификаторВерсии",	ПолучитьИдентификаторАктивнойВерсии(Ответ.file.objectID, ПроксиВебСервиса));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Блокирует файл файловом хранилище по идентификатору
//
//	Параметры:
//	Идентификатор	- строка с уникальным идентификатором файла, полученным при создании файла
//	Организация		- организация, которой принадлежит файл
//
Процедура ЗаблокироватьФайл(Идентификатор) Экспорт
	
	ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	Попытка
		ИдентификаторФайла = СоздатьObjectID(ПроксиВебСервиса, Идентификатор, "DMFile");
	Исключение
		ВызватьИсключение СтрШаблон("При создании идентификатора файла (%1) в хранилище произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Если НЕ ФайлСвободен(ИдентификаторФайла, ПроксиВебСервиса) Тогда
		ВызватьИсключение СтрШаблон("Файл (%1) заблокирован для редактирования! Повторная блокировка невозможна.", Идентификатор);
	КонецЕсли;
	
	УстановитьБлокировкуФайла(ПроксиВебСервиса, ИдентификаторФайла);
	
КонецПроцедуры

// Снимает блокировку файла в хранилище по идентификатору
//
//	Параметры:
//	Идентификатор		- строка с уникальным идентификатором файла, полученным при создании файла
//
Процедура РазблокироватьФайл(Идентификатор, Организация) Экспорт
	
	ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	Попытка
		ИдентификаторФайла = СоздатьObjectID(ПроксиВебСервиса, Идентификатор, "DMFile");
	Исключение
		ВызватьИсключение СтрШаблон("При создании идентификатора файла (%1) в хранилище произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Если ФайлСвободен(ИдентификаторФайла, ПроксиВебСервиса) Тогда
		ВызватьИсключение СтрШаблон("Файл (%1) не заблокирован для редактирования!", Идентификатор);
	КонецЕсли;
	
	СнятьБлокировкуФайла(ПроксиВебСервиса, ИдентификаторФайла);
	
КонецПроцедуры

// Создает новую версию существующего в хранилище файла по идентификатору
//	при этом до создания новой версии файл в хранилище блокируется, а после создания новой версии, блокировка снимается
//
//	Параметры:
//	Идентификатор		- строка с уникальным идентификатором файла, полученным при создании файла
//	Адрес				- адрес временного хранилища, по которому находятся двоичные данные файла
//	Расширение			- расширение файла (без точки)
//	ОтложеннаяВыгрузка	- признак того что это работа с отчетностью. Отчетность сначала сохраняется в буферный регистр ВременноеХранилищеОтчетов.
//	ЭкземплярОтчета 	- строка с идентификатором первой версии файла, необходимо при ЭтоОтчетность = Истина
//	ИмяФайла        	- Имя файла, необходимо при ЭтоОтчетность = Истина
//
// Возвращаемое значение:
//  Строка с идентификатором новой версии
//
Функция ОбновитьФайл(Идентификатор, Адрес, Расширение, ОтложеннаяВыгрузка = Ложь, ЭкземплярОтчета = Неопределено, ИмяФайла = "") Экспорт
	
	Если ОтложеннаяВыгрузка Тогда
		
		Попытка
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(Адрес);
		Исключение
			ВызватьИсключение "При получении данных файла из временного хранилища произошла ошибка: " + ОписаниеОшибки();
		КонецПопытки;
		
		НоваяЗапись = РегистрыСведений.ВременноеХранилищеОтчетов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ЭкземплярОтчета = ЭкземплярОтчета;
		НоваяЗапись.ИдентификаторВерсии = Строка(Новый УникальныйИдентификатор);
		НоваяЗапись.ДвоичныеДанные = Новый ХранилищеЗначения(ДвоичныеДанныеФайла);
		НоваяЗапись.Имя = ИмяФайла;
		НоваяЗапись.Расширение = Расширение;
		НоваяЗапись.ИдентификаторФайла = Идентификатор;
		НоваяЗапись.Записать();		
		
		Возврат НоваяЗапись.ИдентификаторВерсии;
		
	Иначе	
		
		// Получаем прокси веб-сервиса
		ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
		
		// Создаем идентификатор файла в хранилище
		Попытка
			ИдентификаторФайла = СоздатьObjectID(ПроксиВебСервиса, Идентификатор, "DMFile");
		Исключение
			ВызватьИсключение СтрШаблон("При создании идентификатора файла (%1) файловом хранилище произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		Если НЕ ФайлСвободен(ИдентификаторФайла, ПроксиВебСервиса) Тогда
			ВызватьИсключение СтрШаблон("Файл (%1) захвачен для редактирования!", Идентификатор);
		КонецЕсли;
		
		// Блокируем файл
		УстановитьБлокировкуФайла(ПроксиВебСервиса, ИдентификаторФайла);
		
		// Создаем новую версию файла
		Попытка
			Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMUpdateRequest");
		Исключение
			ВызватьИсключение СтрШаблон("При создании запроса обновления файла (%1) в файловом хранилище произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		СписокОбъектов = Запрос.objects;
		
		Попытка
			ОбъектФайл = СоздатьОбъект(ПроксиВебСервиса, "DMFile");
		Исключение
			ВызватьИсключение СтрШаблон("При создании объекта файла (%1) в файловом хранилище произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		ОбъектФайл.objectID	= ИдентификаторФайла;
		ОбъектФайл.name		= "";
		
		Попытка
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(Адрес);
		Исключение
			ВызватьИсключение СтрШаблон("При получении данных файла(%1) произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		ДатаСеанса = ТекущаяДатаСеанса();
		
		ОбъектФайл.binaryData					= ДвоичныеДанныеФайла;
		ОбъектФайл.size							= ДвоичныеДанныеФайла.Размер();
		ОбъектФайл.extension					= Расширение;
		ОбъектФайл.modificationDate				= ДатаСеанса;
		ОбъектФайл.modificationDateUniversal	= УниверсальноеВремя(ДатаСеанса);
		
		СписокОбъектов.Добавить(ОбъектФайл);
		
		Попытка
			Ответ = ПроксиВебСервиса.execute(Запрос);
		Исключение
			ВызватьИсключение СтрШаблон("При выполнении запроса создания новой версии файла (%1) произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
		
		// Разблокируем файл
		//	#Return
		//	Считать ли операцию по созданию версии невыполненной, если не смогли только снять блокировку?
		Попытка
			СнятьБлокировкуФайла(ПроксиВебСервиса, ИдентификаторФайла);
		Исключение
			// При попытке в дальнейшем изменить файл, пользователь получит ошибку, но номер создание и номер версии мы зафиксируем
		КонецПопытки;
		
		Возврат ПолучитьИдентификаторАктивнойВерсии(ИдентификаторФайла, ПроксиВебСервиса);
		
	КонецЕсли;
	
КонецФункции

// Возвращает данные файла из хранилища по идентификатору файла
//
// Параметры:
//   Идентификатор	- строка с идентификатором файла 
//
// Возвращаемое значение:
//  Структура - данные файла
//		свойства структуры:
//			- Адрес 				- строка с адресом временного хранилища, в котором находятся двоичные данные файла
//			- Имя					- имя файла без расширения
//			- Расширение			- расширение файла
//			- ИдентификаторВерсии	- идентификатор версии (актуальной, полученной)
//
Функция ПолучитьФайл(Идентификатор) Экспорт
	
	ДанныеФайла = ПолучитьДанныеФайла(Идентификатор, "DMFile");
	
	Возврат ДанныеФайла;
	
КонецФункции

// Возвращает данные версии файла из хранилища по идентификатору версии
//
// Параметры:
//   Идентификатор	- строка с идентификатором версии файла 
//
// Возвращаемое значение:
//  Структура - данные файла
//		свойства структуры:
//			- Адрес 		- строка с адресом временного хранилища, в котором находятся двоичные данные файла
//			- Имя			- имя файла без расширения
//			- Расширение	- расширение файла
//
Функция ПолучитьВерсиюФайла(Идентификатор) Экспорт
	
	ДанныеФайла = ПолучитьДанныеФайла(Идентификатор, "DMFileVersion");
	
	Возврат ДанныеФайла;
	
КонецФункции

// Возвращает данные о версиях файла, определенного по идентификатору
//
// Параметры:
//   Идентификатор	- строка с идентификатором файла 
//
// Возвращаемое значение:
//  Массив, содержащий структуры с описанием версий файла
//		свойства структуры:
//			- Идентификатор 	- строка с идентификатором версии файла
//			- ВремяСоздания		- дата и время создания версии файла
//			- Автор				- автор версии файла
//			- Размер			- размер файла версии в байтах
//			- АктивнаяВерсия	- признак того, что эта версия является актуальной (последней)
//
Функция ПолучитьСписокВерсийФайла(Идентификатор) Экспорт
	
	// Получаем прокси веб-сервиса
	ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	// Создаем идентификатор файла в хранилище
	Попытка
		ИдентификаторФайла = СоздатьObjectID(ПроксиВебСервиса, Идентификатор, "DMFile");
	Исключение
		ВызватьИсключение СтрШаблон("При создании идентификатора файла (%1) в файловом хранилище произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ИдентификаторАктивнойВерсии = ПолучитьИдентификаторАктивнойВерсии(ИдентификаторФайла, ПроксиВебСервиса);
	
	// Получаем список версий
	Попытка
		Условие = СоздатьОбъект(ПроксиВебСервиса, "DMObjectListCondition");
	Исключение
		ВызватьИсключение "При создании объекта условий отбора произошла ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
	Условие.property	= "owner";
	Условие.value		= ИдентификаторФайла;
	
	Попытка
		СписокУсловий = СоздатьОбъект(ПроксиВебСервиса, "DMObjectListQuery");
	Исключение
		ВызватьИсключение "При создании объекта отбора произошла ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
	УсловияОтбора	= СписокУсловий.conditions; // СписокXDTO
	ПолучаемыеПоля	= СписокУсловий.columnSet; // СписокXDTO
	
	УсловияОтбора.Добавить(Условие);
	
	ПолучаемыеПоля.Добавить("creationDate");
	ПолучаемыеПоля.Добавить("author");
	ПолучаемыеПоля.Добавить("size");
	ПолучаемыеПоля.Добавить("extension");
	
	Попытка
		Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMGetObjectListRequest");
	Исключение
		ВызватьИсключение СтрШаблон("При создании запроса получения списка версий файла (%1) произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Запрос.type		= "DMFileVersion";
	Запрос.Query	= СписокУсловий;
	
	Попытка
		Ответ = ПроксиВебСервиса.execute(Запрос);
	Исключение
		ВызватьИсключение СтрШаблон("При выполнении запроса получения списка версий файла (%1) произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
	
	Результат = Новый Массив;
	
	Для Каждого Версия Из Ответ.items Цикл
		НоваяВерсия = Новый Структура;
		
		НоваяВерсия.Вставить("Идентификатор", 	Версия.object.objectID.id);
		НоваяВерсия.Вставить("ВремяСоздания", 	Версия.object.creationDate);
		НоваяВерсия.Вставить("Автор", 			Версия.object.author.name);
		НоваяВерсия.Вставить("Размер",			Версия.object.size);
		НоваяВерсия.Вставить("Наименование",	Версия.object.name);
		НоваяВерсия.Вставить("Расширение",		Версия.object.extension);
		НоваяВерсия.Вставить("АктивнаяВерсия",	Версия.object.objectID.id = ИдентификаторАктивнойВерсии);
		НоваяВерсия.Вставить("ИндексКартинки",  ПолучитьИндексПиктограммыФайла(Версия.object.extension));
		
		Результат.Добавить(НоваяВерсия);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Удаляет (устанавливает пометку удаления) файл в хранилище по идентификатору
//
//	Параметры:
//	Идентификатор		- строка с уникальным идентификатором файла
//
// Возвращаемое значение:
//  Булево - результат удаления файла
//
Функция УдалитьФайл(Идентификатор) Экспорт
	
	// Получаем прокси веб-сервиса
	ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	Попытка
		Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMDeleteRequest");
	Исключение
		ВызватьИсключение СтрШаблон("При создании запроса удаления файла (%1) произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	СписокОбъектов = Запрос.objectIDs; // СписокXDTO
	
	// Создаем идентификатор файла в хранилище
	Попытка
		ИдентификаторФайла = СоздатьObjectID(ПроксиВебСервиса, Идентификатор, "DMFile");
	Исключение
		ВызватьИсключение СтрШаблон("При создании идентификатора файла (%1) файлового хранилища произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	СписокОбъектов.Добавить(ИдентификаторФайла);
	
	Попытка
		Ответ = ПроксиВебСервиса.execute(Запрос);
	Исключение
		ВызватьИсключение СтрШаблон("При выполнении запроса удаления файла (%1) из файлового хранилища произошла ошибка:%2", Идентификатор, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
	
КонецФункции

// Возвращает данные о версиях файла, определенного по идентификатору
//
// Параметры:
//   ВладелецФайла - ОпределяемыйТип.ВладелецПрисоединенныхФайлов - Ссылка на объект-владелец файла
//
// Возвращаемое значение:
//  Массив, содержащий структуры с описанием версий файла
//		свойства структуры:
//			- Идентификатор 	- строка с идентификатором версии файла
//			- ВремяСоздания		- дата и время создания версии файла
//			- Автор				- автор версии файла
//			- Размер			- размер файла версии в байтах
//			- АктивнаяВерсия	- признак того, что эта версия является актуальной (последней)
//
Функция ПолучитьСписокФайлов(ВладелецФайла) Экспорт
	
	ТипВладельца = ВладелецФайла.Метаданные().ПолноеИмя();
	
	НаименованиеВладельца = Строка(ВладелецФайла);
	ИдентификаторВладельца = Строка(ВладелецФайла.УникальныйИдентификатор());
	
	// Получаем прокси веб-сервиса
	ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMGetFileListRequest");
	ПолучаемыеПоля = Запрос.columnSet; // СписокXDTO
	Владельцы = Запрос.externalObjects; // СписокXDTO
	
	ОбъектВладелец = СоздатьОбъект(ПроксиВебСервиса, "ExternalObject");
	
	ОбъектВладелец.name = НаименованиеВладельца;
	ОбъектВладелец.ID = Строка(ИдентификаторВладельца);
	ОбъектВладелец.type = ТипВладельца;
	
	Владельцы.Добавить(ОбъектВладелец);
	
	ПолучаемыеПоля.Добавить("objectID");
	ПолучаемыеПоля.Добавить("name");
	ПолучаемыеПоля.Добавить("size");
	ПолучаемыеПоля.Добавить("creationDate");
	ПолучаемыеПоля.Добавить("author");
	ПолучаемыеПоля.Добавить("extension");
	ПолучаемыеПоля.Добавить("description");
	ПолучаемыеПоля.Добавить("deletionMark");
	
	Файлы = ПроксиВебСервиса.execute(Запрос);
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Файлы);
	
	Результат = Новый Массив;
	Для каждого Файл Из Файлы.files Цикл
	
		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("ИдентификаторФайла", 	Файл.objectID.ID);
		ДанныеФайла.Вставить("Наименование", 		Файл.name);
		ДанныеФайла.Вставить("Размер", 				Файл.size);
		ДанныеФайла.Вставить("ДатаСоздания", 		Файл.creationDate);
		ДанныеФайла.Вставить("Автор", 				Файл.author.name);
		ДанныеФайла.Вставить("Расширение", 			Файл.extension);
		ДанныеФайла.Вставить("Описание", 			Файл.description);
		ДанныеФайла.Вставить("ПометкаУдаления", 	Файл.deletionMark);
		
		ИндексКартинки = ПолучитьИндексПиктограммыФайла(ДанныеФайла.Расширение);
		Если ДанныеФайла.ПометкаУдаления Тогда
		
			ИндексКартинки = ИндексКартинки + 1;
		
		КонецЕсли; 
		ДанныеФайла.Вставить("ИндексКартинки", 		ИндексКартинки);
		
		Результат.Добавить(ДанныеФайла);
	
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

// Записывает изменения объекта в Документообороте.
//
// Параметры:
//   Прокси - WSПрокси - объект для подключения к web-сервисам Документооборота.
//   Объект - ОбъектXDTO - XDTO объект с сохраняемыми данными.
//
// Возвращаемое значение:
//   ОбъектXDTO - Объект типа DMUpdateResponse.
//
Функция ЗаписатьОбъект(Прокси, Объект) Экспорт
	
	Запрос = СоздатьОбъект(Прокси, "DMUpdateRequest");
	СписокОбъектов = Запрос.objects; // СписокXDTO
	
	СписокОбъектов.Добавить(Объект);
	
	Ответ = Прокси.execute(Запрос);
	ПроверитьВозвратВебСервиса(Прокси, Ответ);
	
	Возврат Ответ;
	
КонецФункции

// Делает активной указанную версию файла.
//
// Параметры:
//   ИдентификаторФайла - Строка - идентификатор файла-владельца.
//   ИдентификаторВерсии - Строка - идентификатор версии, которую следует сделать активной.
//   ТекстСообщения - Строка - неявно возвращаемый параметр, текст сообщения о проблеме.
//
// Возвращаемое значение:
//   Булево - Истина, если операция выполнена успешно.
//
Функция СделатьВерсиюАктивной(ИдентификаторФайла, ИдентификаторВерсии, ТекстСообщения = "") Экспорт
	
	Прокси = ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	Запрос = СоздатьОбъект(Прокси,"DMUpdateRequest");
	СписокОбъектов = Запрос.objects; // СписокXDTO
	
	Файл = СоздатьОбъект(Прокси, "DMFile");
	Файл.objectID = СоздатьObjectID(Прокси, ИдентификаторФайла, "DMFile");
	Файл.name = "";
	Версия = СоздатьОбъект(Прокси, "DMFileVersion");
	Версия.objectID = СоздатьObjectID(Прокси, ИдентификаторВерсии, "DMFileVersion");
	Версия.name = "";
	Файл.activeVersion = Версия;
	СписокОбъектов.Добавить(Файл);
	
	Попытка
		Результат = Прокси.execute(Запрос);
		ПроверитьВозвратВебСервиса(Прокси, Результат);
		Возврат Истина;
	Исключение
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Возвращает количество прикрепленных файлов к связанному объекту 1С:Документооборот.
//
// Параметры:
//   ВладелецФайла - ОпределяемыйТип.ВладелецПрисоединенныхФайлов - Ссылка на объект-владелец файла
//
// Возвращаемое значение:
//   Число - количество прикрепленных файлов.
//
Функция КоличествоФайловСвязанногоОбъекта(ВладелецФайла) Экспорт
	
	ТипВладельца = ВладелецФайла.Метаданные().ПолноеИмя();
		
	НаименованиеВладельца = Строка(ВладелецФайла);
	ИдентификаторВладельца = Строка(ВладелецФайла.УникальныйИдентификатор());
	
	// Получаем прокси веб-сервиса
	ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
	
	Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMGetFileListRequest");
	ПолучаемыеПоля = Запрос.columnSet; // СписокXDTO
	Владельцы = Запрос.externalObjects; // СписокXDTO
	
	ОбъектВладелец = СоздатьОбъект(ПроксиВебСервиса, "ExternalObject");
	
	ОбъектВладелец.name = НаименованиеВладельца;
	ОбъектВладелец.ID = Строка(ИдентификаторВладельца);
	ОбъектВладелец.type = ТипВладельца;
	
	Владельцы.Добавить(ОбъектВладелец);
	
	Файлы = ПроксиВебСервиса.execute(Запрос);
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Файлы);
	
	Если СвойствоУстановлено(Файлы, "files") Тогда
		Возврат Файлы.files.Количество();
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Устанавливает признак наличия присоединенных файлов ДО для объекта ИС.
//
// Параметры:
//   ВладелецФайла - ОпределяемыйТип.ВладелецПрисоединенныхФайлов - Ссылка на объект-владелец файла
//
Процедура ПриИзмененииПрисоединенныхФайлов(ВладелецФайла) Экспорт
	
	Если Не ЗначениеЗаполнено(ВладелецФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецПрисоединенныхФайлов = Метаданные.ОпределяемыеТипы.ВладелецПрисоединенныхФайлов;
	Если Не ВладелецПрисоединенныхФайлов.Тип.СодержитТип(ТипЗнч(ВладелецФайла)) Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоФайлов = КоличествоФайловСвязанногоОбъекта(ВладелецФайла);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьИзменилась = Ложь;
	
	МенеджерЗаписи = РегистрыСведений.НаличиеФайлов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВладелецФайла = ВладелецФайла;
	МенеджерЗаписи.Прочитать();
	
	Если Не ЗначениеЗаполнено(МенеджерЗаписи.ВладелецФайла) Тогда
		МенеджерЗаписи.ВладелецФайла = ВладелецФайла;
		ЗаписьИзменилась = Истина;
	КонецЕсли;
	
	Если КоличествоФайлов > 0 Тогда
		Если Не МенеджерЗаписи.ЕстьФайлы Тогда
			МенеджерЗаписи.ЕстьФайлы = Истина;
			ЗаписьИзменилась = Истина;
		КонецЕсли;
	Иначе
		Если МенеджерЗаписи.ЕстьФайлы Тогда
			МенеджерЗаписи.ЕстьФайлы = Ложь;
			ЗаписьИзменилась = Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	Если ЗаписьИзменилась Тогда
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_Функции

// Возвращает объект прокси для обращения веб-сервису файлового хранилища
// Если в процессе выполнения происходит ошибка - генерируется исключение
//
// Возвращаемое значение
// 	- WSПрокси
//
Функция ПолучитьПроксиВебСервисаФайловогоХранилища(НастройкиПодключения = Неопределено, ИмяСервиса = "DMService") Экспорт
	
	ЭтоТестоваяИнформационнаяБаза = НЕ ОбщегоНазначения.ЗначениеПараметраСеанса("ЭтоРабочаяИнформационнаяБаза");
	
	ТекстСообщенияОбОшибке = "Ошибка подключения к файловому хранилищу!";
	
	Если НастройкиПодключения = Неопределено Тогда
		НастройкиПодключения = ПолучитьНастройкиПодключенияКФайловомуХранилищу();
	КонецЕсли;
	
	Если НастройкиПодключения = Неопределено
		ИЛИ ТипЗнч(НастройкиПодключения) <> Тип("Структура")
		ИЛИ НЕ НастройкиПодключения.Свойство("АутентификацияОС")
		ИЛИ ?(ЭтоТестоваяИнформационнаяБаза, НЕ НастройкиПодключения.Свойство("АдресВебСервисаТестовогоФайловогоХранилища"), НЕ НастройкиПодключения.Свойство("АдресВебСервиса"))
		ИЛИ ?(ЭтоТестоваяИнформационнаяБаза, НЕ ЗначениеЗаполнено(НастройкиПодключения.АдресВебСервисаТестовогоФайловогоХранилища), НЕ ЗначениеЗаполнено(НастройкиПодключения.АдресВебСервиса)) Тогда
		ВызватьИсключение ТекстСообщенияОбОшибке + Символы.ПС + "Не заданы или некорретно заданы настройки подключения к веб-сервису.";
	КонецЕсли;
	
	Если ЭтоТестоваяИнформационнаяБаза Тогда
		АдресВебСервиса 	= НастройкиПодключения.АдресВебСервисаТестовогоФайловогоХранилища;
		АутентификацияОС 	= НастройкиПодключения.АутентификацияОСВТестовомФайловомХранилище;
		ИмяПользователя 	= НастройкиПодключения.ИмяПользователяТестовогоФайловогоХранилища;
		ПарольПользователя 	= НастройкиПодключения.ПарольПользователяТестовогоФайловогоХранилища;
	Иначе
		АдресВебСервиса 	= НастройкиПодключения.АдресВебСервиса;
		АутентификацияОС 	= НастройкиПодключения.АутентификацияОС;
		ИмяПользователя 	= НастройкиПодключения.ИмяПользователя;
		ПарольПользователя 	= НастройкиПодключения.ПарольПользователя;
	КонецЕсли;
	
	// Имя пользователя проверяем только если авторизация не по учетной записи ОС
	Если НЕ АутентификацияОС И НЕ ЗначениеЗаполнено(ИмяПользователя) Тогда
		ВызватьИсключение ТекстСообщенияОбОшибке + Символы.ПС + "Не указан пользователь.";
	КонецЕсли;
	
	МестоположениеWSDL = АдресВебСервиса + ?(Прав(АдресВебСервиса, 1) <> "/", "/", "");
	
	ПараметрыСервиса = ПараметрыСервиса(ИмяСервиса);
	
	Таймаут = 60;
	
	Попытка
		Определения = Новый WSОпределения(МестоположениеWSDL + ПараметрыСервиса.НаименованиеWSDL_cws,
			ИмяПользователя,
			ПарольПользователя,
			Неопределено,
			Таймаут,
			Неопределено,
			АутентификацияОС);
	Исключение
		Определения = Неопределено;
		ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Если Определения = Неопределено Тогда
		Попытка
			Определения = Новый WSОпределения(МестоположениеWSDL + ПараметрыСервиса.НаименованиеWSDL_service,
				ИмяПользователя,
				ПарольПользователя,
				Неопределено,
				Таймаут,
				Неопределено,
				АутентификацияОС);
		Исключение
			Определения = Неопределено;
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Если Определения = Неопределено Тогда
		ВызватьИсключение ТекстСообщенияОбОшибке;
	КонецЕсли;
	
	Попытка
		Прокси = Новый WSПрокси(Определения,
			ПараметрыСервиса.URIПространстваИменСервиса,
			ПараметрыСервиса.ИмяСервиса,
			ПараметрыСервиса.ИмяТочкиПодключения,
			Неопределено,
			Таймаут,
			Неопределено,
			,
			АутентификацияОС);
	Исключение
		ВызватьИсключение ТекстСообщенияОбОшибке + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
		
	Прокси.Пользователь	= ИмяПользователя;
	Прокси.Пароль		= ПарольПользователя;
	
	Возврат Прокси;
	
КонецФункции 

Функция ПараметрыСервиса(ИмяСервиса)

	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("НаименованиеWSDL_cws", "");
	ПараметрыСервиса.Вставить("НаименованиеWSDL_service", "");
	ПараметрыСервиса.Вставить("URIПространстваИменСервиса", "");
	ПараметрыСервиса.Вставить("ИмяСервиса", "");
	ПараметрыСервиса.Вставить("ИмяТочкиПодключения", "");
	
	Если ИмяСервиса = "DMService" Тогда
		ПараметрыСервиса.НаименованиеWSDL_cws = "ws/dm.1cws?wsdl";
		ПараметрыСервиса.НаименованиеWSDL_service = "ws/DMService?wsdl";
		ПараметрыСервиса.URIПространстваИменСервиса = "http://www.1c.ru/dm";
		ПараметрыСервиса.ИмяСервиса = "DMService";
		ПараметрыСервиса.ИмяТочкиПодключения = "DMServiceSoap";
	ИначеЕсли ИмяСервиса = "dmmchd" Тогда
		ПараметрыСервиса.НаименованиеWSDL_cws = "ws/dmmchd.1cws?wsdl";
		ПараметрыСервиса.НаименованиеWSDL_service = "ws/dmmchd?wsdl"; 
		ПараметрыСервиса.URIПространстваИменСервиса = "http://www.1c.ru/dmmchd";
		ПараметрыСервиса.ИмяСервиса = "dmmchd";
		ПараметрыСервиса.ИмяТочкиПодключения = "dmmchdSoap";
	КонецЕсли;  
	
	Возврат ПараметрыСервиса;

КонецФункции

// Определяет существует ли свойство в объекте XDTO.
//
// Параметры:
//   ОбъектXDTO - ОбъектXDTO - исходный объект, свойство которого нужно проверить.
//   ИмяСвойства - Строка - имя свойства.
//
// Возвращаемое значение:
//   Булево - свойство существует.
//
Функция СвойствоСуществует(ОбъектXDTO, ИмяСвойства)
	
	Возврат (ОбъектXDTO.Тип().Свойства.Получить(ИмяСвойства) <> Неопределено);
	
КонецФункции

// Определяет было ли установлено свойство в объекте XDTO.
//
// Параметры:
//   ОбъектXDTO - ОбъектXDTO - исходный объект, свойство которого нужно проверить.
//   ИмяСвойства - Строка - имя свойства.
//
// Возвращаемое значение:
//   Булево - свойство установлено.
//
Функция СвойствоУстановлено(ОбъектXDTO, ИмяСвойства) Экспорт
	
	Возврат (СвойствоСуществует(ОбъектXDTO, ИмяСвойства) И ОбъектXDTO.Установлено(ИмяСвойства));
	
КонецФункции

// Создает XDTO объект указанного типа из пространства имен "http://www.1c.ru/dm".
//
// Параметры:
//   Прокси - WSПрокси - объект для подключения к web-сервисам файлового хранилища.
//   ТипОбъекта - Строка - тип объекта XDTO
//
// Возвращаемое значение:
//  ОбъектXDTO
//
Функция СоздатьОбъект(ПроксиВебСервиса, ТипОбъекта) Экспорт
	
	НовыйОбъект = ПроксиВебСервиса.ФабрикаXDTO.Создать(ПроксиВебСервиса.ФабрикаXDTO.Тип("http://www.1c.ru/dm", ТипОбъекта));
	
	Если СвойствоСуществует(НовыйОбъект, "dataBaseID") Тогда
		НовыйОбъект.dataBaseID = "AssetManagement";
	КонецЕсли;
	
	Возврат НовыйОбъект;
	
КонецФункции

// Проверяет тип объекта XDTO.
//
// Параметры:
//   Прокси - WSПрокси - объект для подключения к web-сервисам файлового хранилища.
//   ОбъектXDTO - ОбъектXDTO - проверяемый объект
//   Тип - Строка - имя типа для проверки
//
// Возвращаемое значение:
//   Булево - Истина если объект является объектом указанного типа и Ложь в противном случае.
//
Функция ПроверитьТип(ПроксиВебСервиса, ОбъектXDTO, Тип)
	
	Возврат ОбъектXDTO.Тип() = ПроксиВебСервиса.ФабрикаXDTO.Тип("http://www.1c.ru/dm", Тип);
	
КонецФункции

// Проверяет возврат веб-сервиса.
//
// Параметры:
//   Прокси - WSПрокси - объект для подключения к web-сервисам файлового хранилища.
//   Ответ - ОбъектXDTO - проверяемый результат вызова сервиса.
//
Процедура ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ)
	
	Если ПроверитьТип(ПроксиВебСервиса, Ответ, "DMError") Тогда
		ВызватьИсключение Ответ.subject + ":" + Символы.ПС + СокрЛП(Ответ.description);
	КонецЕсли;
	
КонецПроцедуры

// Создает объект DMObjectID.
//
// Параметры:
//   Прокси - WSПрокси - объект для подключения к web-сервисам файлового хранилища.
//   ID - Строка - идентификатор объекта XDTO
//   type - Строка - тип объекта XDTO
//
// Возвращаемое значение:
//  ОбъектXDTO
//
Функция СоздатьObjectID(ПроксиВебСервиса, ID, type) Экспорт
	
	objectID = СоздатьОбъект(ПроксиВебСервиса, "DMObjectID");
	objectID.ID = ID;
	objectID.type = type;
	
	Возврат objectID;
	
КонецФункции

// Устанавливает блокировку файла в хранилище по идентификатору объекта в хранилище
//
// Параметры:
//   ПроксиВебСервиса	- прокси веб-сервиса файлового хранилища, полученный путем вызова функции "ПолучитьПроксиВебСервисаФайловогоХранилища"
//   ИдентификаторФайла	- идентификатора объекта в хранилище, полученный путем вызова функции "СоздатьObjectID"
//
Процедура УстановитьБлокировкуФайла(ПроксиВебСервиса, ИдентификаторФайла)
	
	Попытка
		Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMLockFileRequest");
	Исключение
		ВызватьИсключение СтрШаблон("При создании объекта блокировки файла (%1) произошла ошибка:%2", ИдентификаторФайла.ID, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Запрос.objectID = ИдентификаторФайла;
	
	Запрос.lockDate = ТекущаяДата();
	
	Попытка
		Ответ = ПроксиВебСервиса.execute(Запрос);
	Исключение
		ВызватьИсключение СтрШаблон("При выполнении запроса блокировки файла (%1) произошла ошибка:%2", ИдентификаторФайла.ID, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
	
КонецПроцедуры

// Снимает блокировку файла в хранилище по идентификатору объекта в хранилище
//
// Параметры:
//   ПроксиВебСервиса		- прокси веб-сервиса хранилища, полученный путем вызова функции "ПолучитьПроксиВебСервисаФайловогоХранилища"
//   ИдентификаторФайла	- идентификатора объекта в хранилище, полученный путем вызова функции "СоздатьObjectID"
//
Процедура СнятьБлокировкуФайла(ПроксиВебСервиса, ИдентификаторФайла)
	
	Попытка
		Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMUnlockFileRequest");
	Исключение
		ВызватьИсключение СтрШаблон("При создании объекта разблокировки файла (%1) произошла ошибка:%2", ИдентификаторФайла.id, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Запрос.objectID = ИдентификаторФайла;
	
	Попытка
		Ответ = ПроксиВебСервиса.execute(Запрос);
	Исключение
		ВызватьИсключение СтрШаблон("При выполнении запроса разблокировки файла (%1) произошла ошибка:%2", ИдентификаторФайла.id, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
	
КонецПроцедуры

// Проверяет, свободен ли файл (не захвачен ли для редактирования).
//
//	Параметры:
//		ИдентификаторФайла	- идентификатора объекта в хранилище, полученный путем вызова функции "СоздатьObjectID"
//		Организация			- организация, которой принадлежит файл
//		ПроксиВебСервиса	- прокси веб-сервиса файлового хранилища, полученный путем вызова функции "ПолучитьПроксиВебСервисаФайловогоХранилища"
//
//	Возвращаемое значение:
//		Булево - доступность файла для блокировки
//
Функция ФайлСвободен(ИдентификаторФайла, ПроксиВебСервиса)
	
	Попытка
		Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMRetrieveRequest");
	Исключение
		ВызватьИсключение СтрШаблон("При создании запроса получения сведений о файле (%1) произошла ошибка:%2", ИдентификаторФайла.ID, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	СписокОбъектов = Запрос.objectIDs; // СписокXDTO
	
	ПолучаемыеПоля = Запрос.columnSet; // СписокXDTO
	
	СписокОбъектов.Добавить(ИдентификаторФайла);
	
	ПолучаемыеПоля.Добавить("editing");
	ПолучаемыеПоля.Добавить("lockDate");
	
	Попытка
		Ответ = ПроксиВебСервиса.execute(Запрос);
	Исключение
		ВызватьИсключение СтрШаблон("При выполнении запроса получения сведений о файле (%1) произошла ошибка:%2", ИдентификаторФайла.ID, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
	
	Возврат НЕ Ответ.objects[0].editing;
	
КонецФункции

// Возвращает данные файла (актуальной версии) или версии файла из хранилища по идентификатору файла или идентификатору версии
//
// Параметры:
//   Идентификатор	- строка с идентификатором файла или версии файла 
//   Тип			- строка определяющая тип получаемого объекта: файла ("DMFile") или версии ("DMFileVersion")
//
// Возвращаемое значение:
//  Структура - данные файла
//		свойства структуры:
//			- Адрес 				- строка с адресом временного хранилища, в котором находятся двоичные данные файла
//			- Имя					- имя файла без расширения
//			- Расширение			- расширение файла
//			- ИдентификаторВерсии	- идентификатор версии (актуальной, полученной)
//
Функция ПолучитьДанныеФайла(Идентификатор, Тип)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВременноеХранилищеОтчетовСрезПоследних.ИдентификаторВерсии КАК ИдентификаторВерсии,
	|	ВременноеХранилищеОтчетовСрезПоследних.ДвоичныеДанные КАК ДвоичныеДанные,
	|	ВременноеХранилищеОтчетовСрезПоследних.Имя КАК Имя,
	|	ВременноеХранилищеОтчетовСрезПоследних.Расширение КАК Расширение
	|ИЗ
	|	РегистрСведений.ВременноеХранилищеОтчетов.СрезПоследних(, ИдентификаторВерсии = &ИдентификаторВерсии) КАК ВременноеХранилищеОтчетовСрезПоследних";
	
	Запрос.УстановитьПараметр("ИдентификаторВерсии", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат = Новый Структура;
			Результат.Вставить("Адрес",					ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.ДвоичныеДанные.Получить()));
			Результат.Вставить("Имя",					ВыборкаДетальныеЗаписи.Имя);
			Результат.Вставить("Расширение",			ВыборкаДетальныеЗаписи.Расширение);
			Результат.Вставить("ИдентификаторВерсии",	ВыборкаДетальныеЗаписи.ИдентификаторВерсии);
		КонецЦикла;
		
	Иначе
		
		// Получаем прокси веб-сервиса
		ПроксиВебСервиса = ПолучитьПроксиВебСервисаФайловогоХранилища();
		
		// Создаем идентификатор файла в хранилище
		Попытка
			ИдентификаторВДО = СоздатьObjectID(ПроксиВебСервиса, Идентификатор, Тип);
		Исключение
			ВызватьИсключение СтрШаблон("При создании идентификатора (%1) с типом %2 для файлового хранилища произошла ошибка:%3", Идентификатор, Тип, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		Попытка
			Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMRetrieveRequest");
		Исключение
			ВызватьИсключение СтрШаблон("При создании запроса получения объекта (%1) с типом %2 произошла ошибка:%3", Идентификатор, Тип, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		СписокОбъектов = Запрос.objectIDs; // СписокXDTO
		
		ПолучаемыеПоля = Запрос.columnSet; // СписокXDTO
		
		СписокОбъектов.Добавить(ИдентификаторВДО);
		
		ПолучаемыеПоля.Добавить("binaryData");
		ПолучаемыеПоля.Добавить("name");
		ПолучаемыеПоля.Добавить("extension");
		
		Если Тип = "DMFile" Тогда
			ПолучаемыеПоля.Добавить("activeVersion");
		КонецЕсли;
		
		Попытка
			Ответ = ПроксиВебСервиса.execute(Запрос);
		Исключение
			ВызватьИсключение СтрШаблон("При выполнении запроса получения объекта (%1) с типом %2 произошла ошибка:%3", Идентификатор, Тип, Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
		ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
		
		ДанныеФайла = Ответ.objects[0];
		
		Результат = Новый Структура;
		
		Результат.Вставить("Адрес",					ПоместитьВоВременноеХранилище(ДанныеФайла.binaryData));
		Результат.Вставить("Имя",					ДанныеФайла.name);
		Результат.Вставить("Расширение",			ДанныеФайла.extension);
		
		Если Тип = "DMFile" Тогда 
			Результат.Вставить("ИдентификаторВерсии",	ДанныеФайла.activeVersion.objectID.ID);
		Иначе
			Результат.Вставить("ИдентификаторВерсии",	Идентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификатор актуальной версии файла в файловом хранилище
//
// Параметры:
//   ИдентификаторФайла	- идентификатора объекта в хранилище, полученный путем вызова функции "СоздатьObjectID"
//   ПроксиВебСервиса	- прокси веб-сервиса файлового хранилища, полученный путем вызова функции "ПолучитьПроксиВебСервисаФайловогоХранилища"
//
// Возвращаемое значение:
//  строка с идентификатором актуальной версии
//
Функция ПолучитьИдентификаторАктивнойВерсии(ИдентификаторФайла, ПроксиВебСервиса)
	
	// Определяем идентификатор активной версии.
	Попытка
		Запрос = СоздатьОбъект(ПроксиВебСервиса, "DMRetrieveRequest");
	Исключение
		ВызватьИсключение СтрШаблон("При создании запроса получения объекта файла (%1) произошла ошибка:%2", ИдентификаторФайла.ID, Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	СписокОбъектов = Запрос.objectIDs; // СписокXDTO
	
	ПолучаемыеПоля = Запрос.columnSet; // СписокXDTO
	
	СписокОбъектов.Добавить(ИдентификаторФайла);
	
	ПолучаемыеПоля.Добавить("activeVersion");
	
	Попытка
		Ответ = ПроксиВебСервиса.execute(Запрос);
	Исключение
		ВызватьИсключение СтрШаблон("При выполнении для определения актуальной версии файла (%1) произошла ошибка:%2", ИдентификаторФайла.ID, Символы.ПС + ОписаниеОшибки());	КонецПопытки;
	
	ПроверитьВозвратВебСервиса(ПроксиВебСервиса, Ответ);
	
	Возврат Ответ.objects[0].activeVersion.objectID.id;
	
КонецФункции

Функция ПолучитьИндексПиктограммыФайла(Знач РасширениеФайла) Экспорт
	
	Если ТипЗнч(РасширениеФайла) <> Тип("Строка")
		ИЛИ ПустаяСтрока(РасширениеФайла) Тогда
		Возврат 0;
	КонецЕсли;
	
	РасширениеФайла = НРег(СокрЛП(РасширениеФайла));
	
	Если Сред(РасширениеФайла, 1, 1) = "." Тогда
		РасширениеФайла = Сред(РасширениеФайла, 2);
	КонецЕсли;
	
	Расширение = "." + НРег(РасширениеФайла) + ";";
	
	Если СтрНайти(".dt;.1cd;.cf;.cfu;", Расширение) <> 0 Тогда
		Возврат 6; // Файлы 1С.
		
	ИначеЕсли Расширение = ".mxl;" Тогда
		Возврат 8; // Табличный Файл.
		
	ИначеЕсли СтрНайти(".txt;.log;.ini;", Расширение) <> 0 Тогда
		Возврат 10; // Текстовый Файл.
		
	ИначеЕсли Расширение = ".epf;" Тогда
		Возврат 12; // Внешние обработки.
		
	ИначеЕсли СтрНайти(".ico;.wmf;.emf;",Расширение) <> 0 Тогда
		Возврат 14; // Картинки.
		
	ИначеЕсли СтрНайти(".htm;.html;.url;.mht;.mhtml;",Расширение) <> 0 Тогда
		Возврат 16; // HTML.
		
	ИначеЕсли СтрНайти(".doc;.dot;.rtf;",Расширение) <> 0 Тогда
		Возврат 18; // Файл Microsoft Word.
		
	ИначеЕсли СтрНайти(".xls;.xlw;",Расширение) <> 0 Тогда
		Возврат 20; // Файл Microsoft Excel.
		
	ИначеЕсли СтрНайти(".ppt;.pps;",Расширение) <> 0 Тогда
		Возврат 22; // Файл Microsoft PowerPoint.
		
	ИначеЕсли СтрНайти(".vsd;",Расширение) <> 0 Тогда
		Возврат 24; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mpp;",Расширение) <> 0 Тогда
		Возврат 26; // Файл Microsoft Visio.
		
	ИначеЕсли СтрНайти(".mdb;.adp;.mda;.mde;.ade;",Расширение) <> 0 Тогда
		Возврат 28; // База данных Microsoft Access.
		
	ИначеЕсли СтрНайти(".xml;",Расширение) <> 0 Тогда
		Возврат 30; // xml.
		
	ИначеЕсли СтрНайти(".msg;.eml;",Расширение) <> 0 Тогда
		Возврат 32; // Письмо электронной почты.
		
	ИначеЕсли СтрНайти(".zip;.rar;.arj;.cab;.lzh;.ace;",Расширение) <> 0 Тогда
		Возврат 34; // Архивы.
		
	ИначеЕсли СтрНайти(".exe;.com;.bat;.cmd;",Расширение) <> 0 Тогда
		Возврат 36; // Исполняемые файлы.
		
	ИначеЕсли СтрНайти(".grs;",Расширение) <> 0 Тогда
		Возврат 38; // Графическая схема.
		
	ИначеЕсли СтрНайти(".geo;",Расширение) <> 0 Тогда
		Возврат 40; // Географическая схема.
		
	ИначеЕсли СтрНайти(".jpg;.jpeg;.jp2;.jpe;",Расширение) <> 0 Тогда
		Возврат 42; // jpg.
		
	ИначеЕсли СтрНайти(".bmp;.dib;",Расширение) <> 0 Тогда
		Возврат 44; // bmp.
		
	ИначеЕсли СтрНайти(".tif;.tiff;",Расширение) <> 0 Тогда
		Возврат 46; // tif.
		
	ИначеЕсли СтрНайти(".gif;",Расширение) <> 0 Тогда
		Возврат 48; // gif.
		
	ИначеЕсли СтрНайти(".png;",Расширение) <> 0 Тогда
		Возврат 50; // png.
		
	ИначеЕсли СтрНайти(".pdf;",Расширение) <> 0 Тогда
		Возврат 52; // pdf.
		
	ИначеЕсли СтрНайти(".odt;",Расширение) <> 0 Тогда
		Возврат 54; // Open Office writer.
		
	ИначеЕсли СтрНайти(".odf;",Расширение) <> 0 Тогда
		Возврат 56; // Open Office math.
		
	ИначеЕсли СтрНайти(".odp;",Расширение) <> 0 Тогда
		Возврат 58; // Open Office Impress.
		
	ИначеЕсли СтрНайти(".odg;",Расширение) <> 0 Тогда
		Возврат 60; // Open Office draw.
		
	ИначеЕсли СтрНайти(".ods;",Расширение) <> 0 Тогда
		Возврат 62; // Open Office calc.
		
	ИначеЕсли СтрНайти(".mp3;",Расширение) <> 0 Тогда
		Возврат 64;
		
	ИначеЕсли СтрНайти(".erf;",Расширение) <> 0 Тогда
		Возврат 66; // Внешние отчеты.
		
	ИначеЕсли СтрНайти(".docx;",Расширение) <> 0 Тогда
		Возврат 68; // Файл Microsoft Word docx.
		
	ИначеЕсли СтрНайти(".xlsx;",Расширение) <> 0 Тогда
		Возврат 70; // Файл Microsoft Excel xlsx.
		
	ИначеЕсли СтрНайти(".pptx;",Расширение) <> 0 Тогда
		Возврат 72; // Файл Microsoft PowerPoint pptx.
		
	ИначеЕсли СтрНайти(".p7s;",Расширение) <> 0 Тогда
		Возврат 74; // Файл подписи.
		
	ИначеЕсли СтрНайти(".p7m;",Расширение) <> 0 Тогда
		Возврат 76; // зашифрованное сообщение.
	Иначе
		Возврат 4;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
